# WeatherStationName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SiteLocation..::..WeatherStationName Property
SiteLocation Class See Also
---
The name of the weather station at the site location.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014 UR2
# Syntax
C#
---
```text
public string WeatherStationName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WeatherStationName As String
	Get
```

Visual C++
---
```text
public:
property String^ WeatherStationName {
	String^ get ();
}
```

# See Also
SiteLocation Class
Autodesk.Revit.DB Namespace